In [4]:
import pandas as pd

print("Libraries imported Sucessfully...!")

Libraries imported Sucessfully...!

In [24]:
dataframes = pd.read_csv("SalaryGender.csv", header=1)
dataframes.head()

    140  1  47  1.1
0  30.0  0  65    1
1  35.1  0  56    0
2  30.0  1  23    0
3  80.0  0  53    1
4  30.0  0  27    0

In [22]:
new_df = dataframes.drop(['Serial No','Experience'],axis=1)
new_df

     Name        Age     Domain  ML Experience
0    Jack  2.5 years  2.5 years            NaN
1     Jim    5 years    3 years            NaN
2   Jolie   15 years        NaN            NaN
3  Ahitya        NaN        NaN            NaN